from django.db import models

class Tabi(models.Model):

  PLACE = (
    ("北海道"  ,"北海道"  ),  
    ("青森県"  ,"青森県"  ),  
    ("岩手県"  ,"岩手県"  ),  
    ("宮城県"  ,"宮城県"  ),  
    ("秋田県"  ,"秋田県"  ),  
    ("山形県"  ,"山形県"  ),  
    ("福島県"  ,"福島県"  ),  
    ("茨城県"  ,"茨城県"  ),  
    ("栃木県"  ,"栃木県"  ),  
    ("群馬県"  ,"群馬県"  ),  
    ("埼玉県"  ,"埼玉県"  ),  
    ("千葉県"  ,"千葉県"  ),  
    ("東京都"  ,"東京都"  ),  
    ("神奈川県","神奈川県"),
    ("新潟県"  ,"新潟県"  ),  
    ("富山県"  ,"富山県"  ),  
    ("石川県"  ,"石川県"  ),  
    ("福井県"  ,"福井県"  ),  
    ("山梨県"  ,"山梨県"  ),  
    ("長野県"  ,"長野県"  ),  
    ("岐阜県"  ,"岐阜県"  ),  
    ("静岡県"  ,"静岡県"  ),  
    ("愛知県"  ,"愛知県"  ),  
    ("三重県"  ,"三重県"  ),  
    ("滋賀県"  ,"滋賀県"  ),  
    ("京都府"  ,"京都府"  ),  
    ("大阪府"  ,"大阪府"  ),  
    ("兵庫県"  ,"兵庫県"  ),  
    ("奈良県"  ,"奈良県"  ),  
    ("和歌山県","和歌山県"),
    ("鳥取県"  ,"鳥取県"  ),  
    ("島根県"  ,"島根県"  ),  
    ("岡山県"  ,"岡山県"  ),  
    ("広島県"  ,"広島県"  ),  
    ("山口県"  ,"山口県"  ),  
    ("徳島県"  ,"徳島県"  ),  
    ("香川県"  ,"香川県"  ),  
    ("愛媛県"  ,"愛媛県"  ),  
    ("高知県"  ,"高知県"  ),  
    ("福岡県"  ,"福岡県"  ),  
    ("佐賀県"  ,"佐賀県"  ),  
    ("長崎県"  ,"長崎県"  ),  
    ("熊本県"  ,"熊本県"  ),  
    ("大分県"  ,"大分県"  ),  
    ("宮崎県"  ,"宮崎県"  ),  
    ("鹿児島県","鹿児島県"),
    ("沖縄県"  ,"沖縄県"  ),  
  )

  GENRE = (
    ('1', '体験／教室'),
    ('2', 'スポーツ／観戦'),
    ('3', '自然／景色／花'),
    ('4', '動物'),
    ('5', '宿泊'),
    ('6', 'グルメ'),
    ('7', '文化／芸術'),
    ('8', '祭り'),
    ('9', 'テーマパーク'),
    ('10', 'ショッピング'),
    ('11', '世界遺産／遺産'),
    ('12', '乗り物'),
    ('13', 'スパ／エステ／温泉'),
    ('14', '学習／研修'),
    ('15', 'その他'),
  )

  ACCOMPANY = (
    ('A', '単独'),
    ('B', '友人'),
    ('C', '恋人'),
    ('D', '家族'),
    ('E', '仕事関係者'),
    ('F', '趣味仲間'),
    ('G', 'その他'),
  )

  title = models.CharField(verbose_name='旅タイトル', max_length=30)
  date = models.DateField(verbose_name='日付', auto_now=False)
  place = models.CharField(verbose_name='場所', choices=PLACE, max_length=20)
  genre = models.CharField(verbose_name='ジャンル', choices=GENRE, max_length=40)
  accompany = models.CharField(verbose_name='同行者', choices=ACCOMPANY, max_length=10)
  text = models.TextField(verbose_name='メモ')

  class Meta:
    verbose_name_plural = 'Tabi_data'

  def __str__(self):
    return self.title